app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `updated_at`, `email_id`) VALUES('Partha Das', '2011-01-25 05:08:25', '2011-01-25 05:08:25', 'partha@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save